<?php

header("Access-Control-Allow-Origin: *");
header("Access-Control-Allow-Headers", "origin, x-requested-with, content-type");
header("Access-Control-Allow-Methods", "PUT, GET, POST, DELETE, OPTIONS");
header('Content-Type: application/json; charset=utf-8');

if (!isset($_GET['id'])) {
    $result = ['result' => 'Parameters {id} not found in get request', 'status' => '400'];
    echo json_encode($result);
    return;
}

$aData = [
    1 => [
        'name' => 'Менопауза и климактерическое состояние у женщины',
        'code' => 'E28.2',
        'survey' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Анализ крови (натощак)',
                    'values' => [
                        "Клинический анализ крови с лейкоцитарной формулой, СОЭ",
                        "Холестерин общий",
                        "Триглицериды (ТГ)",
                        "Холестерин ЛПВП (ХС ЛПВП)",
                        "Холестерин ЛПНП (ХС ЛПНП)",
                        "АлАТ (АЛТ, Аланинаминотрансфераза, аланинтрансаминаза)",
                        "АсАТ (АСТ, аспартатаминотрансфераза)",
                        "Щелочная фосфатаза (ЩФ)",
                    ]
                ],
                [
                    'name' => 'Анализ жопы (натощак)2',
                    'values' => [
                        "Клинический анализ крови с лейкоцитарной формулой, СОЭ",
                        "Холестерин общий1",
                        "Триглицериды (ТГ)1",
                    ]
                ]
            ]
        ],
        'drug_treatment' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг),Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг)+ Дидрогестерон 10мг',
                    'values' => [
                        "Фемостон 1",
                        "Фемостон 2",
                    ]
                ],
                [
                    'name' => 'Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг), Дроспиренон 2мг',
                    'values' => [
                        "Анжелик",
                    ]
                ]
            ]
        ],
        'recommendations' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Test1',
                    'values' => ['Test12331'],
                ],
                [
                    'name' => 'Test2',
                    'values' => [],
                ],
                [
                    'name' => 'Test3',
                    'values' => [],
                ],
            ]
        ]
    ],
    2 => [
        'name' => 'Менопауза и климактерическое состояние у женщины',
        'code' => 'E28.2',
        'survey' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Анализ крови (натощак)',
                    'values' => [
                        "Клинический анализ крови с лейкоцитарной формулой, СОЭ",
                        "Холестерин общий",
                        "Триглицериды (ТГ)",
                        "Холестерин ЛПВП (ХС ЛПВП)",
                        "Холестерин ЛПНП (ХС ЛПНП)",
                        "АлАТ (АЛТ, Аланинаминотрансфераза, аланинтрансаминаза)",
                        "АсАТ (АСТ, аспартатаминотрансфераза)",
                        "Щелочная фосфатаза (ЩФ)",
                    ],
                ],
                [
                    'name' => 'Анализ жопы (натощак)2',
                    'values' => [
                        "Клинический анализ крови с лейкоцитарной формулой, СОЭ",
                        "Холестерин общий1",
                        "Триглицериды (ТГ)1",
                    ]
                ]
            ]
        ],
        'drug_treatment' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг),Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг)+ Дидрогестерон 10мг',
                    'values' => [
                        "Фемостон 1",
                        "Фемостон 2",
                    ]
                ],
                [
                    'name' => 'Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг), Дроспиренон 2мг',
                    'values' => [
                        "Анжелик",
                    ]
                ]
            ]
        ],
        'recommendations' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Test1',
                    'values' => [],
                ],
                [
                    'name' => 'Test2',
                    'values' => [],
                ],
                [
                    'name' => 'Test3',
                    'values' => [],
                ],
            ]
        ]
    ],
    3 => [
        'name' => 'Менопауза и климактерическое состояние у женщины',
        'code' => 'E28.2',
        'survey' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Анализ крови (натощак)',
                    'values' => [
                        "Клинический анализ крови с лейкоцитарной формулой, СОЭ",
                        "Холестерин общий",
                        "Триглицериды (ТГ)",
                        "Холестерин ЛПВП (ХС ЛПВП)",
                        "Холестерин ЛПНП (ХС ЛПНП)",
                        "АлАТ (АЛТ, Аланинаминотрансфераза, аланинтрансаминаза)",
                        "АсАТ (АСТ, аспартатаминотрансфераза)",
                        "Щелочная фосфатаза (ЩФ)",
                    ],
                ],
                [
                    'name' => 'Анализ жопы (натощак)2',
                    'values' => [
                        "Клинический анализ крови с лейкоцитарной формулой, СОЭ",
                        "Холестерин общий1",
                        "Триглицериды (ТГ)1",
                    ]
                ]
            ]
        ],
        'drug_treatment' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг),Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг)+ Дидрогестерон 10мг',
                    'values' => [
                        "Фемостон 1",
                        "Фемостон 2",
                    ]
                ],
                [
                    'name' => 'Эстрадиола гемигидрат (в пересчете на эстрадиол 1мг), Дроспиренон 2мг',
                    'values' => [
                        "Анжелик",
                    ]
                ]
            ]
        ],
        'recommendations' => [
            'comment' => [
                'recomendation' => 'Текст рекомендации',
                'notrecomendation' => 'Текст не рекомендации'
            ],
            'items' => [
                [
                    'name' => 'Test1',
                    'values' => [],
                ],
                [
                    'name' => 'Test2',
                    'values' => [],
                ],
                [
                    'name' => 'Test3',
                    'values' => [],
                ],
            ]
        ]
    ]
];
   
if (!isset($aData[$_GET['id']])) {
     $result = ['result' => 'Not found items', 'status' => '404'];
    echo json_encode($result);
    return;
}

$result = ['result' => json_encode($aData[$_GET['id']]), 'status' => '200'];
echo json_encode($result);
